/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "İşlem tamamlanamadı";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Bilinmeyen bir hata oluştu (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Eylem Tamamlanamıyor";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Daha sonra yeniden deneyin.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Kayıt Yapılamıyor";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Kayıt yapmayı yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Kayıt Yapılamıyor";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "%@ aygıtını kullanan diğer eylemleri durdurun ve yeniden deneyin."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Kayıt Yapılamıyor";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Kayıt yapmayı yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Kayıt yapmayı yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Dosyayı yazmayı sürdürmek için yeterli boş yer yok. Var olan videoları veya fotoğrafları silerek yer açın.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Kayıt yapmayı yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Kayıt yapmayı yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Kayıt, izin verilen maksimum uzunluğa ulaştı."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Kayıt, izin verilen maksimum dosya büyüklüğüne ulaştı."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Kayıt aygıtını kullanan diğer eylemleri durdurun ve yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Kayıt, izin verilen maksimum uzunluğa ulaştı."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Kayıt Yapılamıyor";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Kayıt yapmayı yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "%@ Kullanılamıyor"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "%@ aygıtını kullanan diğer eylemleri durdurun ve yeniden deneyin."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "%@ Kullanılamıyor"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "%@ aygıtını kullanan diğer eylemleri durdurun ve yeniden deneyin."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Kayıt Durduruldu";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Kayıt aygıtını kullanan diğer eylemleri durdurun ve yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Flaş açılamadı.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Flaşı daha düşük bir düzeyde açmayı deneyin.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Eylem Tamamlanamıyor";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Daha sonra yeniden deneyin.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Dışa Aktarma Tamamlanamıyor";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Dışa aktarmayı yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Kodu Çözülemiyor";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Ortam verilerinin kodu çözülemedi. Hasar görmüş olabilir.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Bu ortam biçimi desteklenmiyor.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Kaydedilemiyor";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Kaydetmeyi yeniden deneyin.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Çıkış dosyası yazılamıyor";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Çıkış uzantısını değiştirin ve yeniden deneyin.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Bu ortam kullanılamıyor.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Bu ortam kullanılamıyor.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Bu ortam kullanılamıyor.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Bu ortam kullanılamıyor.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Bu ortam biçimi desteklenmiyor.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Bu ortam hasar görmüş olabilir.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Fotoğraf Çekilemiyor";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Fotoğraf çekmeyi yeniden deneyin.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "İşlem, korumalı içerikler için desteklenmez."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Bu içerik yetkilendirilmemiş."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Bu uygulama, bu dosyayı çalmaya/oynatmaya yetkili değil."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Bu ortam kullanılamıyor.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Kodu Çözülemiyor";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Bu ortam için gerekli olan kod çözücü bulunamıyor.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Kodlanamıyor";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Bu ortam için gerekli olan kodlayıcı bulunamıyor.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Kodu Çözülemiyor";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Bu ortam için gerekli olan kod çözücü meşgul.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Ortamın kodunu çözen diğer eylemleri durdurun ve yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Kodlanamıyor";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Bu ortam için gerekli olan kodlayıcı meşgul.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Ortamı kodlayan diğer eylemleri durdurun ve yeniden deneyin.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "%@ Kullanılamıyor"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@, arkaplanda çalışan bir uygulama tarafından kullanılamayabilir."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "İşlem, bu ortam için desteklenmiyor.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Video, sağlanan yönergelere göre oluşturulamadı.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Bu ortam kullanılamıyor.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "İndirme hedefi URL’sindeki önbellek dosyası kullanılamıyor.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "Dosyanın sağlama toplamı geçersiz.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "İşlem Kesintiye Uğradı";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Diğer işlemleri durdurun ve yeniden deneyin.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Açılamıyor";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Ortam bu aygıtta kullanılamıyor.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Bu ortam hasar görmüş olabilir.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "İşlem Durduruldu";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Sunucu doğru olarak ayarlanmamış.";
